import React from 'react';
import { Link } from 'react-router-dom';
import Grid from '@mui/material/Grid';
import { Select } from 'antd';

const tags_items = [
    "식비",
    "카페, 간식",
    "편의점, 마트, 잡화",
    "술, 유흥",
    "쇼핑",
    "취미, 여가",
    "의료",
    "건강, 피트니스",
    "주거",
    "통신",
    "보험, 세금, 기타금융",
    "미용",
    "교통",
    "여행, 숙박",
    "교육",
    "기부, 후원, 헌금",
    "급여(알바, 과외)",
    "저축(저금, 적금 등)",
    "주식",
    "연애",
    "선물",
    "기타"
];

const tagMappings = {
    "식비": 'a',
    "카페, 간식": 'b',
    "편의점, 마트, 잡화": 'c',
    "술, 유흥": 'd',
    "쇼핑": 'e',
    "취미, 여가": 'f',
    "의료": 'g',
    "건강, 피트니스": 'h',
    "주거": 'i',
    "통신": 'j',
    "보험, 세금, 기타금융": 'k',
    "미용": 'l',
    "교통": 'm',
    "여행, 숙박": 'n',
    "교육": 'o',
    "기부, 후원, 헌금": 'p',
    "급여(알바, 과외)": 'q',
    "저축(저금, 적금 등)": 'r',
    "주식": 's',
    "연애": 't',
    "선물": 'u',
    "기타": 'v' 
  };
  
  export { tags_items, tagMappings };